docs/20231222 - RKE2 100 clusters 1vs3 nodes comparison/tests_raw_data/benchmark_RKE21-d_management.cattle.io.clusters.txt

          /\      |‾‾| /‾‾/   /‾‾/   
     /\  /  \     |  |/  /   /  /    
    /  \/    \    |     (   /   ‾‾\  
   /          \   |  |\  \ |  (‾)  | 
  / __________ \  |__| \__\ \_____/ .io

  execution: local
     script: ./steve_paginated_api_benchmark.js
     output: -

  scenarios: (100.00%) 1 scenario, 1 max VUs, 24h0m30s max duration (incl. graceful stop):
           * list: 30 iterations for each of 1 VUs (maxDuration: 24h0m0s, exec: list, gracefulStop: 30s)


running (0d00h00m01.0s), 1/1 VUs, 1 complete and 0 interrupted iterations
list   [   3% ] 1 VUs  0d00h00m00.9s/24h0m0s  01/30 iters, 30 per VU

running (0d00h00m02.0s), 1/1 VUs, 4 complete and 0 interrupted iterations
list   [  13% ] 1 VUs  0d00h00m01.9s/24h0m0s  04/30 iters, 30 per VU

running (0d00h00m03.0s), 1/1 VUs, 6 complete and 0 interrupted iterations
list   [  20% ] 1 VUs  0d00h00m02.9s/24h0m0s  06/30 iters, 30 per VU

running (0d00h00m04.0s), 1/1 VUs, 8 complete and 0 interrupted iterations
list   [  27% ] 1 VUs  0d00h00m03.9s/24h0m0s  08/30 iters, 30 per VU

running (0d00h00m05.0s), 1/1 VUs, 8 complete and 0 interrupted iterations
list   [  27% ] 1 VUs  0d00h00m04.9s/24h0m0s  08/30 iters, 30 per VU

running (0d00h00m06.0s), 1/1 VUs, 10 complete and 0 interrupted iterations
list   [  33% ] 1 VUs  0d00h00m05.9s/24h0m0s  10/30 iters, 30 per VU

running (0d00h00m07.0s), 1/1 VUs, 13 complete and 0 interrupted iterations
list   [  43% ] 1 VUs  0d00h00m06.9s/24h0m0s  13/30 iters, 30 per VU

running (0d00h00m08.0s), 1/1 VUs, 15 complete and 0 interrupted iterations
list   [  50% ] 1 VUs  0d00h00m07.9s/24h0m0s  15/30 iters, 30 per VU

running (0d00h00m09.0s), 1/1 VUs, 18 complete and 0 interrupted iterations
list   [  60% ] 1 VUs  0d00h00m08.9s/24h0m0s  18/30 iters, 30 per VU

running (0d00h00m10.0s), 1/1 VUs, 20 complete and 0 interrupted iterations
list   [  67% ] 1 VUs  0d00h00m09.9s/24h0m0s  20/30 iters, 30 per VU

running (0d00h00m11.0s), 1/1 VUs, 22 complete and 0 interrupted iterations
list   [  73% ] 1 VUs  0d00h00m10.9s/24h0m0s  22/30 iters, 30 per VU

running (0d00h00m12.0s), 1/1 VUs, 22 complete and 0 interrupted iterations
list   [  73% ] 1 VUs  0d00h00m11.9s/24h0m0s  22/30 iters, 30 per VU

running (0d00h00m13.0s), 1/1 VUs, 24 complete and 0 interrupted iterations
list   [  80% ] 1 VUs  0d00h00m12.9s/24h0m0s  24/30 iters, 30 per VU

running (0d00h00m14.0s), 1/1 VUs, 27 complete and 0 interrupted iterations
list   [  90% ] 1 VUs  0d00h00m13.9s/24h0m0s  27/30 iters, 30 per VU

running (0d00h00m15.0s), 1/1 VUs, 29 complete and 0 interrupted iterations
list   [  97% ] 1 VUs  0d00h00m14.9s/24h0m0s  29/30 iters, 30 per VU

     ✓ listing management.cattle.io.clusters from cluster local (k8s style pagination) succeeds
     ✓ no slow pagination errors (410 Gone) detected

     █ setup

       ✓ logging in returns status 200

   ✓ checks.........................: 100.00% ✓ 121      ✗ 0  
     data_received..................: 40 MB   2.7 MB/s
     data_sent......................: 95 kB   6.3 kB/s
     http_req_blocked...............: avg=145.57µs min=240ns   med=271ns    max=4.55ms   p(90)=531ns    p(95)=561ns   
     http_req_connecting............: avg=20.91µs  min=0s      med=0s       max=640.37µs p(90)=0s       p(95)=0s      
     http_req_duration..............: avg=217.44ms min=18.67ms med=161ms    max=1.56s    p(90)=392.4ms  p(95)=504.83ms
       { expected_response:true }...: avg=217.44ms min=18.67ms med=161ms    max=1.56s    p(90)=392.4ms  p(95)=504.83ms
     http_req_failed................: 0.00%   ✓ 0        ✗ 61 
     http_req_receiving.............: avg=5.07ms   min=44.39µs med=297.49µs max=24.61ms  p(90)=12.83ms  p(95)=16.82ms 
     http_req_sending...............: avg=306.62µs min=33.29µs med=68.11µs  max=3.99ms   p(90)=637.75µs p(95)=1.52ms  
     http_req_tls_handshaking.......: avg=111.83µs min=0s      med=0s       max=3.59ms   p(90)=0s       p(95)=0s      
     http_req_waiting...............: avg=212.06ms min=18.4ms  med=160.82ms max=1.53s    p(90)=379.53ms p(95)=493.66ms
     http_reqs......................: 61      4.052268/s
     iteration_duration.............: avg=485.55ms min=84.39ms med=368.01ms max=1.77s    p(90)=597.52ms p(95)=1.1s    
     iterations.....................: 30      1.992918/s
     vus............................: 1       min=1      max=1
     vus_max........................: 1       min=1      max=1


running (0d00h00m15.1s), 0/1 VUs, 30 complete and 0 interrupted iterations
list ✓ [ 100% ] 1 VUs  0d00h00m15.0s/24h0m0s  30/30 iters, 30 per VU