docs/20231222 - RKE2 100 clusters 1vs3 nodes comparison/tests_raw_data/benchmark_RKE30-a_management.cattle.io.clusters.txt

          /\      |‾‾| /‾‾/   /‾‾/   
     /\  /  \     |  |/  /   /  /    
    /  \/    \    |     (   /   ‾‾\  
   /          \   |  |\  \ |  (‾)  | 
  / __________ \  |__| \__\ \_____/ .io

  execution: local
     script: ./steve_paginated_api_benchmark.js
     output: -

  scenarios: (100.00%) 1 scenario, 1 max VUs, 24h0m30s max duration (incl. graceful stop):
           * list: 30 iterations for each of 1 VUs (maxDuration: 24h0m0s, exec: list, gracefulStop: 30s)


running (0d00h00m01.0s), 1/1 VUs, 2 complete and 0 interrupted iterations
list   [   7% ] 1 VUs  0d00h00m00.9s/24h0m0s  02/30 iters, 30 per VU

running (0d00h00m02.0s), 1/1 VUs, 5 complete and 0 interrupted iterations
list   [  17% ] 1 VUs  0d00h00m01.9s/24h0m0s  05/30 iters, 30 per VU

running (0d00h00m03.0s), 1/1 VUs, 8 complete and 0 interrupted iterations
list   [  27% ] 1 VUs  0d00h00m02.9s/24h0m0s  08/30 iters, 30 per VU

running (0d00h00m04.0s), 1/1 VUs, 11 complete and 0 interrupted iterations
list   [  37% ] 1 VUs  0d00h00m03.9s/24h0m0s  11/30 iters, 30 per VU

running (0d00h00m05.0s), 1/1 VUs, 14 complete and 0 interrupted iterations
list   [  47% ] 1 VUs  0d00h00m04.9s/24h0m0s  14/30 iters, 30 per VU

running (0d00h00m06.0s), 1/1 VUs, 16 complete and 0 interrupted iterations
list   [  53% ] 1 VUs  0d00h00m05.9s/24h0m0s  16/30 iters, 30 per VU

running (0d00h00m07.0s), 1/1 VUs, 19 complete and 0 interrupted iterations
list   [  63% ] 1 VUs  0d00h00m06.9s/24h0m0s  19/30 iters, 30 per VU

running (0d00h00m08.0s), 1/1 VUs, 22 complete and 0 interrupted iterations
list   [  73% ] 1 VUs  0d00h00m07.9s/24h0m0s  22/30 iters, 30 per VU

running (0d00h00m09.0s), 1/1 VUs, 25 complete and 0 interrupted iterations
list   [  83% ] 1 VUs  0d00h00m08.9s/24h0m0s  25/30 iters, 30 per VU

running (0d00h00m10.0s), 1/1 VUs, 28 complete and 0 interrupted iterations
list   [  93% ] 1 VUs  0d00h00m09.9s/24h0m0s  28/30 iters, 30 per VU

     ✓ listing management.cattle.io.clusters from cluster local (k8s style pagination) succeeds
     ✓ no slow pagination errors (410 Gone) detected

     █ setup

       ✓ logging in returns status 200

   ✓ checks.........................: 100.00% ✓ 121      ✗ 0  
     data_received..................: 40 MB   3.9 MB/s
     data_sent......................: 87 kB   8.4 kB/s
     http_req_blocked...............: avg=210.01µs min=250ns   med=281ns    max=7.96ms   p(90)=571ns    p(95)=661ns   
     http_req_connecting............: avg=27.39µs  min=0s      med=0s       max=840.93µs p(90)=0s       p(95)=0s      
     http_req_duration..............: avg=138.43ms min=9.77ms  med=77.37ms  max=347.82ms p(90)=270.26ms p(95)=302.93ms
       { expected_response:true }...: avg=138.43ms min=9.77ms  med=77.37ms  max=347.82ms p(90)=270.26ms p(95)=302.93ms
     http_req_failed................: 0.00%   ✓ 0        ✗ 61 
     http_req_receiving.............: avg=4.66ms   min=74.4µs  med=1.26ms   max=18.39ms  p(90)=10.44ms  p(95)=10.97ms 
     http_req_sending...............: avg=270.44µs min=33.96µs med=84.04µs  max=5.12ms   p(90)=176.03µs p(95)=620.83µs
     http_req_tls_handshaking.......: avg=116.43µs min=0s      med=0s       max=3.88ms   p(90)=0s       p(95)=0s      
     http_req_waiting...............: avg=133.49ms min=9.59ms  med=77.1ms   max=339.05ms p(90)=261.8ms  p(95)=294.71ms
     http_reqs......................: 61      5.896368/s
     iteration_duration.............: avg=333.67ms min=85.68ms med=334.75ms max=424.08ms p(90)=376.78ms p(95)=387.26ms
     iterations.....................: 30      2.899853/s
     vus............................: 1       min=1      max=1
     vus_max........................: 1       min=1      max=1


running (0d00h00m10.3s), 0/1 VUs, 30 complete and 0 interrupted iterations
list ✓ [ 100% ] 1 VUs  0d00h00m10.3s/24h0m0s  30/30 iters, 30 per VU