docs/20231222 - RKE2 100 clusters 1vs3 nodes comparison/tests_raw_data/benchmark_RKE30-c_management.cattle.io.clusters.txt

          /\      |‾‾| /‾‾/   /‾‾/   
     /\  /  \     |  |/  /   /  /    
    /  \/    \    |     (   /   ‾‾\  
   /          \   |  |\  \ |  (‾)  | 
  / __________ \  |__| \__\ \_____/ .io

  execution: local
     script: ./steve_paginated_api_benchmark.js
     output: -

  scenarios: (100.00%) 1 scenario, 1 max VUs, 24h0m30s max duration (incl. graceful stop):
           * list: 30 iterations for each of 1 VUs (maxDuration: 24h0m0s, exec: list, gracefulStop: 30s)


running (0d00h00m01.0s), 1/1 VUs, 2 complete and 0 interrupted iterations
list   [   7% ] 1 VUs  0d00h00m00.9s/24h0m0s  02/30 iters, 30 per VU

running (0d00h00m02.0s), 1/1 VUs, 5 complete and 0 interrupted iterations
list   [  17% ] 1 VUs  0d00h00m01.9s/24h0m0s  05/30 iters, 30 per VU

running (0d00h00m03.0s), 1/1 VUs, 8 complete and 0 interrupted iterations
list   [  27% ] 1 VUs  0d00h00m02.9s/24h0m0s  08/30 iters, 30 per VU

running (0d00h00m04.0s), 1/1 VUs, 11 complete and 0 interrupted iterations
list   [  37% ] 1 VUs  0d00h00m03.9s/24h0m0s  11/30 iters, 30 per VU

running (0d00h00m05.0s), 1/1 VUs, 14 complete and 0 interrupted iterations
list   [  47% ] 1 VUs  0d00h00m04.9s/24h0m0s  14/30 iters, 30 per VU

running (0d00h00m06.0s), 1/1 VUs, 17 complete and 0 interrupted iterations
list   [  57% ] 1 VUs  0d00h00m05.9s/24h0m0s  17/30 iters, 30 per VU

running (0d00h00m07.0s), 1/1 VUs, 20 complete and 0 interrupted iterations
list   [  67% ] 1 VUs  0d00h00m06.9s/24h0m0s  20/30 iters, 30 per VU

running (0d00h00m08.0s), 1/1 VUs, 23 complete and 0 interrupted iterations
list   [  77% ] 1 VUs  0d00h00m07.9s/24h0m0s  23/30 iters, 30 per VU

running (0d00h00m09.0s), 1/1 VUs, 25 complete and 0 interrupted iterations
list   [  83% ] 1 VUs  0d00h00m08.9s/24h0m0s  25/30 iters, 30 per VU

running (0d00h00m10.0s), 1/1 VUs, 28 complete and 0 interrupted iterations
list   [  93% ] 1 VUs  0d00h00m09.9s/24h0m0s  28/30 iters, 30 per VU

     ✓ listing management.cattle.io.clusters from cluster local (k8s style pagination) succeeds
     ✓ no slow pagination errors (410 Gone) detected

     █ setup

       ✓ logging in returns status 200

   ✓ checks.........................: 100.00% ✓ 121      ✗ 0  
     data_received..................: 40 MB   3.9 MB/s
     data_sent......................: 83 kB   8.0 kB/s
     http_req_blocked...............: avg=221.35µs min=240ns   med=321ns    max=8.45ms   p(90)=561ns    p(95)=671ns   
     http_req_connecting............: avg=30.34µs  min=0s      med=0s       max=1.06ms   p(90)=0s       p(95)=0s      
     http_req_duration..............: avg=140.14ms min=9.79ms  med=76.63ms  max=317.56ms p(90)=285.07ms p(95)=313.75ms
       { expected_response:true }...: avg=140.14ms min=9.79ms  med=76.63ms  max=317.56ms p(90)=285.07ms p(95)=313.75ms
     http_req_failed................: 0.00%   ✓ 0        ✗ 61 
     http_req_receiving.............: avg=4.53ms   min=74.42µs med=217.14µs max=18.63ms  p(90)=10.16ms  p(95)=10.33ms 
     http_req_sending...............: avg=392.04µs min=35.74µs med=91.04µs  max=5.61ms   p(90)=453.21µs p(95)=1.08ms  
     http_req_tls_handshaking.......: avg=152.41µs min=0s      med=0s       max=5.19ms   p(90)=0s       p(95)=0s      
     http_req_waiting...............: avg=135.21ms min=9.57ms  med=76.32ms  max=308.86ms p(90)=273.62ms p(95)=307.23ms
     http_reqs......................: 61      5.873106/s
     iteration_duration.............: avg=334.98ms min=85.49ms med=335.76ms max=390.54ms p(90)=385ms    p(95)=389.01ms
     iterations.....................: 30      2.888413/s
     vus............................: 1       min=1      max=1
     vus_max........................: 1       min=1      max=1


running (0d00h00m10.4s), 0/1 VUs, 30 complete and 0 interrupted iterations
list ✓ [ 100% ] 1 VUs  0d00h00m10.3s/24h0m0s  30/30 iters, 30 per VU